# ThermalMaterialParamPermeability Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ThermalMaterialParamPermeability Property
ParameterTypeId Class See Also
---
"Permeability"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ThermalMaterialParamPermeability { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ThermalMaterialParamPermeability As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ThermalMaterialParamPermeability {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace